{"keras_version": "2.0.3", "config": {"layers": [{"config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, null, null, 3]}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"name": "block1_conv1", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block1_conv2", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block1_pool", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"name": "block2_conv1", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block2_conv2", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block2_pool", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"name": "block3_conv1", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block3_conv2", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block3_conv3", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block3_conv4", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block3_conv4", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block3_pool", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"name": "block4_conv1", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block4_conv2", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block4_conv3", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block4_conv4", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block4_conv4", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block4_pool", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"name": "block5_conv1", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block5_conv2", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block5_conv3", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block5_conv4", "kernel_constraint": null, "filters": 512, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "use_bias": true}, "name": "block5_conv4", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "block5_pool", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D"}], "name": "vgg19", "input_layers": [["input_1", 0, 0]], "output_layers": [["global_average_pooling2d_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}